Revit 2027 API
Space.LightingCalculationWorkplane Property
Get or set the Lighting Calculation Workplane of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LightingCalculationWorkplane { get; set; }
Public Property LightingCalculationWorkplane As Double
	Get
	Set
public:
property double LightingCalculationWorkplane {
	double get ();
	void set (double value);
}
member LightingCalculationWorkplane : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Lighting Calculation Workplane (Unit: feet) of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace